#необходимо создать класс, в котором несколько объектов - блоки для очистки данных, чтобы их можно было подключать к 
#данным из СБИС, а не только из ретроспективы. Совместить данные из СБИС (если есть возможность получить ретроспективные данные из выгрузок) с данными компании





def open_data():
    data = open('C:/Users/ADM/Desktop/данные/Обучение/python_files/аналитика/1.19.csv', 'rt', encoding='utf-8')
    first_data = data.readlines()
    second_data = [] 
    for i in range(len(first_data)-1):
        second_data.append(first_data[i].split(';'))
    data.close()
    return second_data

second_data = open_data()

def title_column_data(second_data):
    title_column = []
    for i in range(len(second_data[0])):
        if '\n' in second_data[0][i]:
            second_data[0][i].strip()
        title_column.append(second_data[0][i] + ':')
    return title_column

title_column = title_column_data()

my_data = second_data[4:]
my_data.append(second_data[1])
    
def columns_data(title_column, my_data):    
    columns = []
    for number_row in range(len(title_column)-1):
        column = []
        for number_column in range(len(my_data)-1):
            column.append(my_data[number_column][number_row])
        columns.append(column)
    return columns

columns = columns_data()

def create_table(title_column, columns):    
    table = {}
    for i in range(len(title_column)-1):
        table[title_column[i]] = columns[i]
    return table

table = create_table()


cites = '22	Алтайский край 28	Амурская область 29	Архангельская область 30	Астраханская область 31	Белгородская область 32	Брянская область 33	Владимирская область 34	Волгоградская область 35	Вологодская область 36	Воронежская область 77	г. Москва 79	Еврейская автономная область 75	Забайкальский край 37	Ивановская область 99	Иные территории, включая город и космодром Байконур 38	Иркутская область 07	Кабардино-Балкарская Республика 39	Калининградская область 40	Калужская область 41	Камчатский край 09	Карачаево-Черкесская Республика 42	Кемеровская область — Кузбасс 43	Кировская область 44	Костромская область 23	Краснодарский край 24	Красноярский край 45	Курганская область 46	Курская область 47	Ленинградская область 48	Липецкая область 49	Магаданская область 50	Московская область 51	 Мурманская область 83	Ненецкий автономный округ 52	Нижегородская область 53	Новгородская область 54	Новосибирская область 55	Омская область 56	Оренбургская область 57	Орловская область 58	Пензенская область 59	Пермский край 25	Приморский край 60	Псковская область 01	Республика Адыгея (Адыгея) 04	Республика Алтай 02	Республика Башкортостан 03	Республика Бурятия 05	Республика Дагестан 06	Республика Ингушетия 08	Республика Калмыкия 10	Республика Карелия 11	Республика Коми 91	Республика Крым 12	Республика Марий Эл 13	Республика Мордовия 14	Республика Саха (Якутия) 15	Республика Северная Осетия — Алания 16	Республика Татарстан (Татарстан) 17	Республика Тыва 19	Республика Хакасия 61	Ростовская область 62	Рязанская область 63	Самарская область 78	Санкт-Петербург 64	Саратовская область 65	Сахалинская область 66	Свердловская область 92	Севастополь 67	Смоленская область 26	Ставропольский край 68	Тамбовская область 69	Тверская область 70	Томская область 71	Тульская область 72	Тюменская область 18	Удмуртская Республика 73	Ульяновская область 27	Хабаровский край 86	Ханты-Мансийский автономный округ — Югра 74	Челябинская область 20	Чеченская Республика 21	Чувашская Республика — Чувашия 87	Чукотский автономный округ 89	Ямало-Ненецкий автономный округ 76	Ярославская область'.split()

def clear_city(cites):
    city = {}
    region = ''
    for i in range(len(cites) - 1):
        if cites[i].isdigit() == False:
            region += cites[i] + ' '
        else:
            city.append(region.strip())
            region = ''

    return city

cuty = clear_city(cites)
print(cuty)
        





